Angulo_Ataque_0/Velocidad_1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;
solver          shockFluid;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000; // Ojo: 2000 seg es mucho, vigílalo

// --- CORRECCIÓN 1: Paso de tiempo inicial pequeño ---
deltaT          1e-6;

writeControl    timeStep;
writeInterval   100; // Ajusta según necesites (ej. cada 100 pasos)
purgeWrite      0;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

// --- CORRECCIÓN 2: Control automático obligatorio para shockFluid ---
adjustTimeStep  yes;
maxCo           0.5;  // Mantenlo bajo (< 1.0) para estabilidad
maxDeltaT       1e-2; // Límite superior por si acaso

// --- CORRECCIÓN 3: Cargar tus cálculos de Lift/Drag ---
functions
{
    #include "functions"
}


// ************************************************************************* //
