Angulo_Ataque_0/Velocidad_1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    aerofoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          220;
        startFace       50020;
    }
    inlet
    {
        type            patch;
        inGroups        List<word> 1(freestream);
        nFaces          420;
        startFace       50240;
    }
    outlet
    {
        type            patch;
        inGroups        List<word> 1(freestream);
        nFaces          120;
        startFace       50660;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25200;
        startFace       50780;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25200;
        startFace       75980;
    }
)

// ************************************************************************* //
