Angulo_Ataque_0/Velocidad_1/constant/simParams
// Archivo: constant/simParams


angleVal        0.0;    // Angulo de ataque (grados)
speedVal        34.3;   // Velocidad (m/s)