Angulo_Ataque_0/Velocidad_1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 1. CARGAMOS LOS PARAMETROS
#include "../constant/simParams"

// 2. CALCULAMOS VECTORES AUTOMATICAMENTE
// Usamos las variables $angleVal y $speedVal del archivo incluido

angle           #calc "-degToRad($angleVal)";

#calcInclude    "transform.H"
// Nota: Ry rota alrededor del eje Y (que es tu eje de profundidad)
liftDir         #calc "transform(Ry($angle), vector(0, 0, 1))";
dragDir         #calc "transform(Ry($angle), vector(1, 0, 0))";

Uinlet          #calc "$speedVal*$<vector>dragDir";

// 3. DEFINICIONES OBLIGATORIAS (Aqui estaba tu error)
dimensions      [0 1 -1 0 0 0 0]; // m/s

internalField   uniform $Uinlet;

boundaryField
{
    
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }
    
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform $Uinlet;
        value           uniform $Uinlet;
    }

    wall
    {
        type            slip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //