Angulo_Ataque_0/Velocidad_1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }
}

PIMPLE
{
    momentumPredictor no;      // No predecir (ya lo hace shockFluid)
    nOuterCorrectors 1;        // Solo 1 corrección externa
    nCorrectors      1;        // Solo 1 corrección interna
    nNonOrthogonalCorrectors 0;
}

// Sin relajación para solvers explícitos
relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

// ************************************************************************* //
